* Project
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX : <https://www.openmicroscopy.org/omemap/>
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  select distinct  ?ds ?tp where {
  ?ds a ome_core:Project ;
      rdf:type ?tp ;
  }
  limit 10
#+end_src

#+RESULTS:
| ds                                 | tp                                                         |
|------------------------------------+------------------------------------------------------------|
| https://example.org/site/Project/1 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/Project |

* Dataset 
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX : <https://www.openmicroscopy.org/omemap/>
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  select ?ds where {
  ?ds a ome_core:Dataset .
  }
  limit 10
#+end_src

#+RESULTS:
| ds                                 |
|------------------------------------|
| https://example.org/site/Dataset/3 |
| https://example.org/site/Dataset/2 |
| https://example.org/site/Dataset/1 |

* Dataset II
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX : <https://www.openmicroscopy.org/omemap/>
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  select distinct * where {
  ?ds a ome_core:Dataset .
  ?ds ?prop ?value .
  }
  limit 10
#+end_src

#+RESULTS:
| ds                                 | prop                                                     | value                                                         |
|------------------------------------+----------------------------------------------------------+---------------------------------------------------------------|
| https://example.org/site/Dataset/1 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/image | https://example.org/site/Image/1                              |
| https://example.org/site/Dataset/1 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/image | https://example.org/site/Image/2                              |
| https://example.org/site/Dataset/1 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type          | http://www.openmicroscopy.org/rdf/2016-06/ome_core/Dataset    |
| https://example.org/site/Dataset/1 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type          | http://www.openmicroscopy.org/rdf/2016-06/ome_core/Folder     |
| https://example.org/site/Dataset/1 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type          | http://www.openmicroscopy.org/rdf/2016-06/ome_core/WellSample |
| https://example.org/site/Dataset/1 | http://purl.org/dc/terms/contributor                     | Test User                                                     |
| https://example.org/site/Dataset/1 | http://purl.org/dc/terms/provenance                      | Screenshots                                                   |
| https://example.org/site/Dataset/1 | http://purl.org/dc/terms/subject                         | Test images                                                   |
| https://example.org/site/Dataset/1 | http://www.w3.org/2000/01/rdf-schema#label               | Dataset 1                                                     |
| https://example.org/site/Dataset/2 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/image | https://example.org/site/Image/3                              |

* Image properties
:PROPERTIES:
:ID:       7452daa7-4c93-448f-9c35-6a9efd910cb1
:END:
#+begin_src sparql :url http://localhost:8080/sparql

   PREFIX : <https://www.openmicroscopy.org/omemap/>
   PREFIX owl: <http://www.w3.org/2002/07/owl#>
   PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
   PREFIX xml: <http://www.w3.org/XML/1998/namespace>
   PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
   PREFIX obda: <https://w3id.org/obda/vocabulary#>
   PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
   PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
   PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>
   prefix dc: <http://purl.org/dc/terms/>

  SELECT distinct ?prop WHERE {
      ?img a ome_core:Image;
           ?prop ?val .
   }
#+end_src

#+RESULTS:
| prop                                            |
|-------------------------------------------------|
| http://purl.org/dc/terms/contributor            |
| http://purl.org/dc/terms/date                   |
| http://purl.org/dc/terms/subject                |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type |
| http://www.w3.org/2000/01/rdf-schema#label      |

* Number of projects, datasets, images
:PROPERTIES:
:ID:       b8d9a7e6-cb6f-46a3-a198-f8a57a3e81ba
:END:
#+begin_src sparql :url http://localhost:8080/sparql
 PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  select (count(?project) as ?nproj) where {
  ?project a ome_core:Project .
  }
#+end_src

#+RESULTS:
| nproj |
|-------|
|     1 |

#+begin_src sparql :url http://localhost:8080/sparql
 PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  select (count(?dataset) as ?nds) where {
  ?dataset a ome_core:Dataset .
  }
#+end_src

#+RESULTS:
| nds |
|-----|
|   3 |

#+begin_src sparql :url http://localhost:8080/sparql
 PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  select (count(?img) as ?nimg) where {
  ?img a ome_core:Image .
  }
#+end_src
#+RESULTS:
| nimg |
|------|
|   10 |

* Project and contained datasets
:PROPERTIES:
:ID:       9114c7b4-6367-43f6-a8d2-9583999e554f
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX : <https://www.openmicroscopy.org/omemap/>
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  select * where {
  ?proj a ome_core:Project ;
           rdfs:label ?lbl .
  ?ds a ome_core:Dataset .
  ?proj ome_core:dataset ?ds .
  }
limit 20
#+end_src

#+RESULTS:
| proj                               | lbl     | ds                                 |
|------------------------------------+---------+------------------------------------|
| https://example.org/site/Project/1 | Project | https://example.org/site/Dataset/1 |
| https://example.org/site/Project/1 | Project | https://example.org/site/Dataset/3 |
| https://example.org/site/Project/1 | Project | https://example.org/site/Dataset/2 |

* Project with datasets and images
:PROPERTIES:
:ID:       9114c7b4-6367-43f6-a8d2-9583999e554f
:END:
#+begin_src sparql :url http://localhost:8080/sparql
    PREFIX : <https://www.openmicroscopy.org/omemap/>
    PREFIX owl: <http://www.w3.org/2002/07/owl#>
    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX xml: <http://www.w3.org/XML/1998/namespace>
    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
    PREFIX obda: <https://w3id.org/obda/vocabulary#>
    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
    PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
    PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

    select distinct * where {
    ?proj a ome_core:Project ;
      ome_core:dataset ?dataset .
    ?dataset a ome_core:Dataset ;
      ome_core:image ?image .
    ?image a ome_core:Image ;
      rdfs:label ?name .
    }
  order by ?image ?dataset ?proj
  limit 20

#+end_src

#+RESULTS:
| proj                               | dataset                            | image                             | name                               |
|------------------------------------+------------------------------------+-----------------------------------+------------------------------------|
| https://example.org/site/Project/1 | https://example.org/site/Dataset/1 | https://example.org/site/Image/1  | 2024-10-10_14-58-36_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/3 | https://example.org/site/Image/10 | 2024-10-10_16-39-27_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/1 | https://example.org/site/Image/2  | 2024-10-10_14-53-28_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/3  | 2024-10-10_15-17-25_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/4  | 2024-10-10_15-28-16_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/5  | 2024-10-10_15-01-36_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/6  | 2024-10-10_15-09-28_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/7  | 2024-10-10_15-07-18_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/3 | https://example.org/site/Image/8  | 2024-10-10_16-47-01_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/3 | https://example.org/site/Image/9  | 2024-10-10_16-42-47_screenshot.png |

* Dataset subject as per map annotation, queried by namespace:key concatenation (dc:subject)
:PROPERTIES:
:ID:       39bce638-19c5-4ed5-9428-7bfdbdc64b72
:END:
#+begin_src sparql :url http://localhost:8080/sparql

   PREFIX : <https://www.openmicroscopy.org/omemap/>
   PREFIX owl: <http://www.w3.org/2002/07/owl#>
   PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
   PREFIX xml: <http://www.w3.org/XML/1998/namespace>
   PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
   PREFIX obda: <https://w3id.org/obda/vocabulary#>
   PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
   PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
   PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>
   prefix dc: <http://purl.org/dc/terms/>

  SELECT distinct ?ds ?subject WHERE {
      ?ds a ome_core:Dataset;
           dc:subject ?subject .
   }
  order by ?img
#+end_src

#+RESULTS:
| ds                                 | subject       |
|------------------------------------+---------------|
| https://example.org/site/Dataset/1 | Test images   |
| https://example.org/site/Dataset/2 | Test images   |
| https://example.org/site/Dataset/3 | OMERO Mapping |
