* Project
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX : <https://www.openmicroscopy.org/omemap/>
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  select distinct  ?ds ?tp where {
  ?ds a ome_core:Project ;
      rdf:type ?tp ;
  }
  limit 10
#+end_src

#+RESULTS:
| ds                                 | tp                                                         |
|------------------------------------+------------------------------------------------------------|
| https://example.org/site/Project/1 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/Project |

* Dataset 
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX : <https://www.openmicroscopy.org/omemap/>
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  select ?ds where {
  ?ds a ome_core:Dataset .
  }
  limit 10
#+end_src

#+RESULTS:
| ds                                 |
|------------------------------------|
| https://example.org/site/Dataset/3 |
| https://example.org/site/Dataset/2 |
| https://example.org/site/Dataset/1 |

* Dataset II
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX : <https://www.openmicroscopy.org/omemap/>
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  select distinct * where {
  ?ds a ome_core:Dataset .
  ?ds ?prop ?value .
  }
#+end_src

#+RESULTS:
| ds                                 | prop                                                                  | value                                                      |
|------------------------------------+-----------------------------------------------------------------------+------------------------------------------------------------|
| https://example.org/site/Dataset/1 | http://www.w3.org/2000/01/rdf-schema#label                            | Dataset 1                                                  |
| https://example.org/site/Dataset/1 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/image              | https://example.org/site/Image/1                           |
| https://example.org/site/Dataset/1 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/image              | https://example.org/site/Image/2                           |
| https://example.org/site/Dataset/1 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type                       | http://www.openmicroscopy.org/rdf/2016-06/ome_core/Dataset |
| https://example.org/site/Dataset/1 | http://purl.org/dc/terms/provenance                                   | Screenshots                                                |
| https://example.org/site/Dataset/1 | http://purl.org/dc/terms/subject                                      | Test images                                                |
| https://example.org/site/Dataset/1 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/tagAnnotationValue | TestTag                                                    |
| https://example.org/site/Dataset/1 | http://purl.org/dc/terms/contributor                                  | Test User                                                  |
| https://example.org/site/Dataset/2 | http://www.w3.org/2000/01/rdf-schema#label                            | Dataset 2                                                  |
| https://example.org/site/Dataset/2 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/image              | https://example.org/site/Image/3                           |
| https://example.org/site/Dataset/2 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/image              | https://example.org/site/Image/4                           |
| https://example.org/site/Dataset/2 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/image              | https://example.org/site/Image/5                           |
| https://example.org/site/Dataset/2 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/image              | https://example.org/site/Image/6                           |
| https://example.org/site/Dataset/2 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/image              | https://example.org/site/Image/7                           |
| https://example.org/site/Dataset/2 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type                       | http://www.openmicroscopy.org/rdf/2016-06/ome_core/Dataset |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/provenance                                   | Screenshots                                                |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/subject                                      | Test images                                                |
| https://example.org/site/Dataset/2 | http://purl.org/dc/terms/contributor                                  | Test User                                                  |
| https://example.org/site/Dataset/3 | http://purl.org/dc/terms/contributor                                  | Caligula                                                   |
| https://example.org/site/Dataset/3 | http://www.w3.org/2000/01/rdf-schema#label                            | Dataset 3                                                  |
| https://example.org/site/Dataset/3 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/image              | https://example.org/site/Image/10                          |
| https://example.org/site/Dataset/3 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/image              | https://example.org/site/Image/8                           |
| https://example.org/site/Dataset/3 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/image              | https://example.org/site/Image/9                           |
| https://example.org/site/Dataset/3 | http://www.w3.org/1999/02/22-rdf-syntax-ns#type                       | http://www.openmicroscopy.org/rdf/2016-06/ome_core/Dataset |
| https://example.org/site/Dataset/3 | http://purl.org/dc/terms/subject                                      | OMERO Mapping                                              |
| https://example.org/site/Dataset/3 | http://purl.org/dc/terms/provenance                                   | Screenshots                                                |

* Project Dataset Image hierarchy
:PROPERTIES:
:ID:       9a7fae93-80a0-4cf9-b889-a60113b9bf01
:END:
#+begin_src sparql :url http://localhost:8080/sparql :async yes
  prefix omekg: <https://ld.openmicroscopy.org/omekg/>
  prefix omeprop: <https://ld.openmicroscopy.org/omekg#>

  SELECT distinct *  WHERE {
      ?project a omekg:Project ;
                omeprop:dataset ?dataset .
      ?dataset a omekg:Dataset ;
                omeprop:image ?image .
      ?image a omekg:Image ;
              rdfs:label ?image_name .
  }
#+end_src

#+RESULTS:
| project                            | dataset                            | image                             | image_name                                 |
|------------------------------------+------------------------------------+-----------------------------------+--------------------------------------------|
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/7  | 2024-10-10_15-07-18_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/3  | 2024-10-10_15-17-25_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/12 | image_6_with_roi.ome.tif                   |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/11 | 2024-10-10_15-28-16_screenshot.png.ome.tif |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/1 | https://example.org/site/Image/2  | 2024-10-10_14-53-28_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/5  | 2024-10-10_15-01-36_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/3 | https://example.org/site/Image/8  | 2024-10-10_16-47-01_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/1 | https://example.org/site/Image/1  | 2024-10-10_14-58-36_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/3 | https://example.org/site/Image/10 | 2024-10-10_16-39-27_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/3 | https://example.org/site/Image/9  | 2024-10-10_16-42-47_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/6  | 2024-10-10_15-09-28_screenshot.png         |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/4  | 2024-10-10_15-28-16_screenshot.png         |

* Image with owner
:PROPERTIES:
:ID:       c856598c-c952-4964-b4b2-40b4a1269afc
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX : <https://www.openmicroscopy.org/omemap/>
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
  prefix vcard: <https://www.w3.org/2006/vcard/ns#>
  prefix ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>
  SELECT distinct ?img ?roi WHERE {
      ?img a ome_core:Image;
          ^ome_core:image ?roi .
      ?roi a ome_core:RegionOfInterest .
  }
  #+end_src

#+RESULTS:
| img                               | roi                                         |
|-----------------------------------+---------------------------------------------|
| https://example.org/site/Image/5  | https://example.org/site/RegionOfInterest/1 |
| https://example.org/site/Image/6  | https://example.org/site/RegionOfInterest/2 |
| https://example.org/site/Image/11 | https://example.org/site/RegionOfInterest/3 |
| https://example.org/site/Image/22 | https://example.org/site/RegionOfInterest/4 |
| https://example.org/site/Image/23 | https://example.org/site/RegionOfInterest/5 |

* Image with owner
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX : <https://www.openmicroscopy.org/omemap/>
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>
  prefix vcard: <https://www.w3.org/2006/vcard/ns#>
  select distinct * where {
  ?ds a ome_core:Image .
  ?ds ome_core:experimenterGroup ?owner .
  }
#+end_src

#+RESULTS:
| ds | owner |
|----+-------|

* Dataset number of type relations
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX : <https://www.openmicroscopy.org/omemap/>
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>


    select (count(distinct ?tp) as ?n_types) where {
        ?s a ome_core:Dataset;
            a ?tp .
}

#+end_src

#+RESULTS:
| n_types |
|---------|
|       1 |

* Dataset type relations
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql :url http://localhost:8080/sparql
    PREFIX : <https://www.openmicroscopy.org/omemap/>
    PREFIX owl: <http://www.w3.org/2002/07/owl#>
    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX xml: <http://www.w3.org/XML/1998/namespace>
    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
    PREFIX obda: <https://w3id.org/obda/vocabulary#>
    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
    PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
    PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>


      select ?s ?tp  where {
          ?s a ome_core:Dataset;
              a ?tp .
  }
  order by ?tp

#+end_src

#+RESULTS:
| s                                  | tp                                                         |
|------------------------------------+------------------------------------------------------------|
| https://example.org/site/Dataset/1 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/Dataset |
| https://example.org/site/Dataset/2 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/Dataset |
| https://example.org/site/Dataset/3 | http://www.openmicroscopy.org/rdf/2016-06/ome_core/Dataset |

* Image properties
:PROPERTIES:
:ID:       7452daa7-4c93-448f-9c35-6a9efd910cb1
:END:
#+begin_src sparql :url http://localhost:8080/sparql

   PREFIX : <https://www.openmicroscopy.org/omemap/>
   PREFIX owl: <http://www.w3.org/2002/07/owl#>
   PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
   PREFIX xml: <http://www.w3.org/XML/1998/namespace>
   PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
   PREFIX obda: <https://w3id.org/obda/vocabulary#>
   PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
   PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
   PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>
   prefix dc: <http://purl.org/dc/terms/>

  SELECT distinct ?prop WHERE {
      ?img a ome_core:Image;
           ?prop ?val .
   }
#+end_src

#+RESULTS:
| prop                                            |
|-------------------------------------------------|
| http://purl.org/dc/terms/contributor            |
| http://purl.org/dc/terms/date                   |
| http://purl.org/dc/terms/subject                |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type |
| http://www.w3.org/2000/01/rdf-schema#label      |

* Number of projects, datasets, images
:PROPERTIES:
:ID:       b8d9a7e6-cb6f-46a3-a198-f8a57a3e81ba
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  select ?n_projects ?n_datasets ?n_images where {
    {
      select (count(?project) as ?n_projects) where {
        ?project a ome_core:Project .
      }
    }
    {
      select (count(?dataset) as ?n_datasets) where {
        ?dataset a ome_core:Dataset .
      }
    }
    {
      select (count(?image) as ?n_images) where {
        ?image a ome_core:Image .
      }
    }
  }
#+end_src

#+RESULTS:
| n_projects | n_datasets | n_images |
|------------+------------+----------|
|          1 |          3 |       10 |

* Project and contained datasets
:PROPERTIES:
:ID:       9114c7b4-6367-43f6-a8d2-9583999e554f
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX : <https://www.openmicroscopy.org/omemap/>
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  select * where {
  ?proj a ome_core:Project ;
           rdfs:label ?lbl .
  ?ds a ome_core:Dataset .
  ?proj ome_core:dataset ?ds .
  }
limit 20
#+end_src

#+RESULTS:
| proj                               | lbl     | ds                                 |
|------------------------------------+---------+------------------------------------|
| https://example.org/site/Project/1 | Project | https://example.org/site/Dataset/1 |
| https://example.org/site/Project/1 | Project | https://example.org/site/Dataset/3 |
| https://example.org/site/Project/1 | Project | https://example.org/site/Dataset/2 |

* Project with datasets and images
:PROPERTIES:
:ID:       9114c7b4-6367-43f6-a8d2-9583999e554f
:END:
#+begin_src sparql :url http://localhost:8080/sparql
    PREFIX : <https://www.openmicroscopy.org/omemap/>
    PREFIX owl: <http://www.w3.org/2002/07/owl#>
    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
    PREFIX xml: <http://www.w3.org/XML/1998/namespace>
    PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
    PREFIX obda: <https://w3id.org/obda/vocabulary#>
    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
    PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
    PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

    select distinct * where {
    ?proj a ome_core:Project ;
      ome_core:dataset ?dataset .
    ?dataset a ome_core:Dataset ;
      ome_core:image ?image .
    ?image a ome_core:Image ;
      rdfs:label ?name .
    }
  order by ?image ?dataset ?proj
  limit 20

#+end_src

#+RESULTS:
| proj                               | dataset                            | image                             | name                               |
|------------------------------------+------------------------------------+-----------------------------------+------------------------------------|
| https://example.org/site/Project/1 | https://example.org/site/Dataset/1 | https://example.org/site/Image/1  | 2024-10-10_14-58-36_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/3 | https://example.org/site/Image/10 | 2024-10-10_16-39-27_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/1 | https://example.org/site/Image/2  | 2024-10-10_14-53-28_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/3  | 2024-10-10_15-17-25_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/4  | 2024-10-10_15-28-16_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/5  | 2024-10-10_15-01-36_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/6  | 2024-10-10_15-09-28_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/2 | https://example.org/site/Image/7  | 2024-10-10_15-07-18_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/3 | https://example.org/site/Image/8  | 2024-10-10_16-47-01_screenshot.png |
| https://example.org/site/Project/1 | https://example.org/site/Dataset/3 | https://example.org/site/Image/9  | 2024-10-10_16-42-47_screenshot.png |

* Dataset subject as per map annotation, queried by namespace:key concatenation (dc:subject)
:PROPERTIES:
:ID:       39bce638-19c5-4ed5-9428-7bfdbdc64b72
:END:
#+begin_src sparql :url http://localhost:8080/sparql

   PREFIX : <https://www.openmicroscopy.org/omemap/>

   PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
   PREFIX xml: <http://www.w3.org/XML/1998/namespace>
   PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
   PREFIX obda: <https://w3id.org/obda/vocabulary#>
   PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
   PREFIX omemap: <https://www.openmicroscopy.org/omemap#>
   PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>
   prefix dc: <http://purl.org/dc/terms/>

  SELECT distinct ?ds ?subject WHERE {
      ?ds a ome_core:Dataset;
           dc:subject ?subject .
   }
  order by ?img
#+end_src

#+RESULTS:
| ds                                 | subject       |
|------------------------------------+---------------|
| https://example.org/site/Dataset/1 | Test images   |
| https://example.org/site/Dataset/2 | Test images   |
| https://example.org/site/Dataset/3 | OMERO Mapping |

* Tagged images
:PROPERTIES:
:ID:       3fb29f13-6b99-4d93-9757-7b6d90a40e93
:END:

#+begin_src sparql :url http://localhost:8080/sparql

  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  SELECT distinct ?img ?tag WHERE {
      ?img a ome_core:Image;
           ome_core:tagAnnotationValue ?tag .
   }
  order by ?img
#+end_src

#+RESULTS:
| img                               | tag        |
|-----------------------------------+------------|
| https://example.org/site/Image/1  | Screenshot |
| https://example.org/site/Image/10 | Screenshot |
| https://example.org/site/Image/2  | Screenshot |
| https://example.org/site/Image/3  | Screenshot |
| https://example.org/site/Image/4  | Screenshot |
| https://example.org/site/Image/5  | Screenshot |
| https://example.org/site/Image/6  | Screenshot |
| https://example.org/site/Image/7  | Screenshot |
| https://example.org/site/Image/8  | Screenshot |
| https://example.org/site/Image/9  | Screenshot |


* Tagged dataset
:PROPERTIES:
:ID:       5ccad4e1-5090-438e-b90c-ede0bd3356bc
:END:

Find all datasets tagged "TestTag".

#+begin_src sparql :url http://localhost:8080/sparql

  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  SELECT distinct ?ds ?name WHERE {
      ?ds a ome_core:Dataset;
           ome_core:tagAnnotationValue ?tag .
    filter(regex(?tag, "^TestTag$"))
    ?ds rdfs:label ?name .
   }
  order by ?img
#+end_src

#+RESULTS:
| ds                                 | name      |
|------------------------------------+-----------|
| https://example.org/site/Dataset/1 | Dataset 1 |

* Number of contained images per dataset (by aggregation)
:PROPERTIES:
:ID:       5ccad4e1-5090-438e-b90c-ede0bd3356bc
:END:

Find all datasets tagged "TestTag".

#+begin_src sparql :url http://localhost:8080/sparql

  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  SELECT distinct ?ds (count(?img) as ?number_of_images) WHERE {
      ?ds a ome_core:Dataset;
          ome_core:image ?img
   }
  group by ?ds
#+end_src

#+RESULTS:
| ds                                 | number_of_images |
|------------------------------------+------------------|
| https://example.org/site/Dataset/3 |                3 |
| https://example.org/site/Dataset/2 |                5 |
| https://example.org/site/Dataset/1 |                2 |

* Folder 
:PROPERTIES:
:ID:       c97f7deb-8163-4c3d-9c8f-ed50b3e36552
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX : <https://www.openmicroscopy.org/omemap/>
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  select ?s where {
  ?s a ome_core:Folder 
  }
  limit 10
#+end_src

#+RESULTS:
| s |
|---|


* MPIEB
:PROPERTIES:
:ID:       1bdfaf0a-1483-44e0-b216-f97a319293b5
:END:
** SPO
:PROPERTIES:
:ID:       b11378ed-b938-4bb9-ad4b-b9cd0df59f75
:END:

#+begin_src sparql :url http://localhost:8080/sparql

  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>

  SELECT distinct ?ds (count(?img) as ?number_of_images) WHERE {
      ?ds a ome_core:Dataset;
          ome_core:image ?img
   }
  group by ?ds
#+end_src

#+RESULTS:
| ds                                 | number_of_images |
|------------------------------------+------------------|
| https://example.org/site/Dataset/3 |                3 |
| https://example.org/site/Dataset/2 |                7 |
| https://example.org/site/Dataset/1 |                2 |

* Namespace fixed
:PROPERTIES:
:ID:       f538ab93-67f7-4a3e-aa6e-9b6d82e2f99c
:END:

#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>
  PREFIX image: <https://example.org/site/Image/>
  PREFIX ome_ns: <http://www.openmicroscopy.org/ns/default/>

  SELECT DISTINCT * WHERE {
    image:11 ome_ns:sampletype ?val.
   }
#+end_src

#+RESULTS:
| val    |
|--------|
| screen |


* Image 9 MouseCT/Skyscan/System namespace
:PROPERTIES:
:ID:       d2ec4a2a-806a-45ae-95a0-3b36d16aa030
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  PREFIX ome_core: <http://www.openmicroscopy.org/rdf/2016-06/ome_core/>
  PREFIX image: <https://example.org/site/Image/>
  PREFIX ome_ns: <http://www.openmicroscopy.org/ns/default/>

  SELECT DISTINCT * WHERE {
    image:9 ?prop ?val .
   }
#+end_src

#+RESULTS:
| prop                                                                  | val                                                      |
|-----------------------------------------------------------------------+----------------------------------------------------------|
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type                       | http://www.openmicroscopy.org/rdf/2016-06/ome_core/Image |
| http://www.openmicroscopy.org/rdf/2016-06/ome_core/tagAnnotationValue | Screenshot                                               |
| http://purl.org/dc/elements/1.1/identifier                            | 9                                                        |
| http://www.w3.org/2000/01/rdf-schema#label                            | 2024-10-10_16-42-47_screenshot.png                       |
| http://purl.org/dc/terms/contributor                                  | Test User                                                |
| http://purl.org/dc/terms/subject                                      | Unittest                                                 |
| http://purl.org/dc/terms/date                                         | Sat Dec 21 06:08:37 PM CET 2024                          |
| http://MouseCT/Skyscan/System/Assay                                   | Bruker                                                   |


* Image and Experimenter
:PROPERTIES:
:ID:       b6fdc8c2-cadf-4241-a9d0-28f49b6efd1c
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  prefix omekg: <https://ld.openmicroscopy.org/omekg/>
  prefix omeprop: <https://ld.openmicroscopy.org/omekg#>
  prefix foaf: <http://xmlns.com/foaf/0.1/>
  select * where {
    ?img a omekg:Image;
         omeprop:experimenter ?owner .
    ?owner foaf:firstName ?first .
    ?owner foaf:lastName ?last .
#+end_src

* Pixels and channels.
:PROPERTIES:
:ID:       b6fdc8c2-cadf-4241-a9d0-28f49b6efd1c
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  prefix omekg: <https://ld.openmicroscopy.org/omekg/>
  prefix omeprop: <https://ld.openmicroscopy.org/omekg#>
  prefix foaf: <http://xmlns.com/foaf/0.1/>
  select distinct ?prop ?val where {
    ?img a omekg:Pixels;
         ?prop ?val .
    filter(contains(str(?prop), "size"))
   }
  limit 10
#+end_src

** Pixels
:PROPERTIES:
:ID:       f163b456-8c98-424b-9e8b-8d302642d707
:END:
#+RESULTS:
| prop                                                     | val                |
|----------------------------------------------------------+--------------------|
| https://ld.openmicroscopy.org/omekg#physical_size_y_unit | µm                 |
| https://ld.openmicroscopy.org/omekg#physical_size_y      | 0.7400001049041748 |
| https://ld.openmicroscopy.org/omekg#physical_size_x      | 0.7400001049041748 |
| https://ld.openmicroscopy.org/omekg#physical_size_x_unit | µm                 |

** Channels
:PROPERTIES:
:ID:       365db89d-2153-4920-b49c-ed349dca9e29
:END:
#+begin_src sparql :url http://localhost:8080/sparql
  prefix omekg: <https://ld.openmicroscopy.org/omekg/>
  prefix omeprop: <https://ld.openmicroscopy.org/omekg#>
  prefix foaf: <http://xmlns.com/foaf/0.1/>
  select distinct ?prop where {
    ?channel a omekg:Channel;
         ?prop ?val .
   }
  limit 100
#+end_src

#+RESULTS:
| prop                                            |
|-------------------------------------------------|
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type |
| https://ld.openmicroscopy.org/omekg#pixels      |
| http://purl.org/dc/elements/1.1/identifier      |
| https://ld.openmicroscopy.org/omekg#green       |
| https://ld.openmicroscopy.org/omekg#blue        |
| https://ld.openmicroscopy.org/omekg#red         |

#+begin_src sparql :url http://localhost:8080/sparql
    prefix omekg: <https://ld.openmicroscopy.org/omekg/>
    prefix omeprop: <https://ld.openmicroscopy.org/omekg#>
    prefix foaf: <http://xmlns.com/foaf/0.1/>
    select ?pixels (min(?red) as ?min_red) (min(?green) as ?min_green) (min(?blue) as ?min_blue) (max(?red) as ?max_red) (max(?green) as ?max_green) (max(?blue) as ?max_blue)
  where {
      ?channel a omekg:Channel;
               omeprop:pixels ?pixels;
               omeprop:red ?red;
               omeprop:green ?green;
               omeprop:blue ?blue .
     }
  group by ?pixels
  limit 100
#+end_src

#+RESULTS:
| pixels                              | min_red | min_green | min_blue | max_red | max_green | max_blue |
|-------------------------------------+---------+-----------+----------+---------+-----------+----------|
| https://example.org/site/Pixels/1   |       0 |         0 |        0 |     255 |       255 |      255 |
| https://example.org/site/Pixels/2   |       0 |         0 |        0 |     255 |       255 |      255 |
| https://example.org/site/Pixels/3   |       0 |         0 |        0 |     255 |       255 |      255 |
| https://example.org/site/Pixels/4   |       0 |         0 |        0 |     255 |       255 |      255 |
| https://example.org/site/Pixels/5   |       0 |         0 |        0 |     255 |       255 |      255 |
| https://example.org/site/Pixels/6   |       0 |         0 |        0 |     255 |       255 |      255 |
| https://example.org/site/Pixels/7   |       0 |         0 |        0 |     255 |       255 |      255 |
| https://example.org/site/Pixels/8   |       0 |         0 |        0 |     255 |       255 |      255 |
| https://example.org/site/Pixels/9   |       0 |         0 |        0 |     255 |       255 |      255 |
| https://example.org/site/Pixels/10  |       0 |         0 |        0 |     255 |       255 |      255 |
| https://example.org/site/Pixels/11  |       0 |         0 |        0 |     255 |       255 |      255 |
| https://example.org/site/Pixels/12  |       0 |         0 |        0 |     255 |       255 |      255 |
| https://example.org/site/Pixels/244 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/245 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/246 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/247 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/248 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/249 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/250 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/251 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/252 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/253 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/254 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/255 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/256 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/257 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/258 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/259 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/260 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/261 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/262 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/263 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/264 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/265 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/266 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/267 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/268 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/269 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/270 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/271 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/272 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/273 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/274 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/275 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/276 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/277 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/278 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/279 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/280 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/281 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/282 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/283 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/284 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/285 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/286 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/287 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/288 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/289 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/290 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/291 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/292 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/293 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/294 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/295 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/296 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/297 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/298 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/299 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/300 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/301 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/302 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/303 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/304 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/305 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/306 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/307 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/308 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/309 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/310 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/311 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/312 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/313 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/314 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/315 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/316 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/317 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/318 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/319 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/320 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/321 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/322 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/323 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/324 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/325 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/326 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/327 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/328 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/329 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/330 |       0 |         0 |        0 |     255 |         0 |      255 |
| https://example.org/site/Pixels/331 |       0 |         0 |        0 |     255 |         0 |      255 |

* Owners and Groups
:PROPERTIES:
:ID:       83f91f9d-a78e-44a0-ae4c-f24046beaa26
:END:

#+begin_src sparql :url http://localhost:8080/sparql
  prefix omekg: <https://ld.openmicroscopy.org/omekg/>
  prefix omeprop: <https://ld.openmicroscopy.org/omekg#>
  prefix foaf: <http://xmlns.com/foaf/0.1/>

  SELECT distinct * WHERE {
      ?s a omekg:Project ;
  omeprop:owner ?owner;
  omeprop:group ?group .
  }
 #+end_src

 #+RESULTS:
 | s                                  | owner                                   | group                                        |
 |------------------------------------+-----------------------------------------+----------------------------------------------|
 | https://example.org/site/Project/1 | https://example.org/site/Experimenter/0 | https://example.org/site/ExperimenterGroup/0 |
